export const cameraModes = {
    "section4":  [
        {
            "id": 0,
            "title": "風景をダイナミックに切り撮る、超広角カメラ",
            "lead": "目の前に広がる感動を一枚に。"
        },
        {
            "id": 1,
            "title": "細部まで鮮明に描写できる、広角カメラ",
            "lead": "約6,400万画素で、拡大しても細部までくっきり。"
        },
        {
            "id": 2,
            "title": "背景ぼかしも思いのまま、深度測位カメラ",
            "lead": "被写体を際立たせて印象的な写真に。"
        },
        {
            "id": 3,
            "title": "小さな被写体も表情豊かに撮影。",
            "lead": "もっと近寄れる、マクロカメラ。"
        },
    ],
    "section5":  [
        {
            "id": 0,
            "title": "モノカラー",
            "lead": "特定の色を指定して撮影するだけ。<br>それ以外の色がモノクロに。"
        },
        {
            "id": 1,
            "title": "マニュアル",
            "lead": "特別な一枚は、こだわりの設定で思いのままに。"
        },
        {
            "id": 2,
            "title": "モノクロ背景",
            "lead": "人物をカラーに、背景をモノクロに。<br>印象的な一枚も自動認識で簡単に。"
        },
    ]
};