import type { NextPage } from 'next'
import { CustomHead } from '@components/utils/CustomHead'
import { GlobalFooter } from '@components/molecules/GlobalFooter'
import { SystemContainer, SystemWrapper } from '@components/layout/System'
import { Heading } from '@components/atoms/Heading'
import Utils from '@styles/Utils.module.scss'
import React from 'react'
import { GlobalHeader } from '@components/molecules/GlobalHeader'
import { BreadcrumbsHead } from '@components/atoms/BreadcrumbsHead'
import { LinkNormal } from '@components/atoms/Link'

const InfoFailure2563Archive: NextPage = () => {
  const pagetitle =
    '【災害影響】令和6年能登半島地震の影響により、一部のお客様において通信サービスがご利用できない、またはご利用しづらい状況について'
  const description = ''
  const directories = [
    { path: '/information/', label: 'お知らせ' },
    { path: '/information/failure/', label: '障害情報のお知らせ' },
  ]
  const breadcrumbs = [
    {
      text: 'トップ',
      url: '/',
    },
    {
      text: directories[0].label,
      url: directories[0].path,
    },
    {
      text: directories[1].label,
      url: directories[1].path,
    },
    {
      text: pagetitle,
      url: '',
    },
  ]

  return (
    <>
      <CustomHead
        directories={directories}
        description={description}
        pagetitle={pagetitle}
        noindex={true}
      />
      <SystemWrapper>
        <GlobalHeader />
        <BreadcrumbsHead item={breadcrumbs} />
        <SystemContainer>
          <Heading level="2" as="h1" className={Utils['Mt-32']}>
            {pagetitle}
          </Heading>
          <Heading level="4" as="h2" className={Utils['Mt-56']}>
            更新履歴
          </Heading>
          <ul className={Utils['Mt-16']}>
            <li>（初報）2024年1月1日午後6時10分</li>
            <li>（第2報）2024年1月1日午後9時00分</li>
            <li>（第3報）2024年1月2日午前9時30分</li>
            <li>（第4報）2024年1月2日午後2時00分</li>
            <li>（第5報）2024年1月2日午後6時30分</li>
            <li>（第6報）2024年1月3日午前9時30分</li>
            <li>（第7報）2024年1月3日午後0時00分</li>
            <li>（第8報）2024年1月3日午後7時00分</li>
            <li>（第9報）2024年1月4日午前10時00分</li>
            <li>（第10報）2024年1月4日午後2時00分</li>
            <li>（第11報）2024年1月4日午後7時00分</li>
            <li>（第12報）2024年1月5日午前9時00分</li>
            <li>（第13報）2024年1月5日午後2時00分</li>
            <li>（第14報）2024年1月5日午後8時00分</li>
            <li>（第15報）2024年1月6日午前9時30分</li>
            <li>（第16報）2024年1月6日午後3時00分</li>
            <li>（第17報）2024年1月6日午後8時00分</li>
            <li>（第18報）2024年1月6日午後10時50分</li>
            <li>（第19報）2024年1月7日午前10時30分</li>
            <li>（第20報）2024年1月7日午後1時00分</li>
            <li>（第21報）2024年1月7日午後6時30分</li>
            <li>（第22報）2024年1月8日午前11時30分</li>
            <li>（第23報）2024年1月8日午後2時30分</li>
            <li>（第24報）2024年1月8日午後8時30分</li>
            <li>（第25報）2024年1月9日午前10時00分</li>
            <li>（第26報）2024年1月9日午後2時00分</li>
            <li>（第27報）2024年1月9日午後7時00分</li>
            <li>（第28報）2024年1月10日午前10時30分</li>
            <li>（第29報）2024年1月10日午後3時00分</li>
            <li>（第30報）2024年1月10日午後8時15分</li>
            <li>（第31報）2024年1月11日午前10時00分</li>
            <li>（第32報）2024年1月11日午後3時15分</li>
            <li>（第33報）2024年1月11日午後8時00分</li>
            <li>（第34報）2024年1月12日午前10時00分</li>
            <li>（第35報）2024年1月12日午後1時00分</li>
            <li>（第36報）2024年1月12日午後8時00分</li>
            <li>（第37報）2024年1月13日午前10時00分</li>
            <li>（第38報）2024年1月13日午後1時00分</li>
            <li>（第39報）2024年1月13日午後5時00分</li>
            <li>（第40報）2024年1月14日午前9時00分</li>
            <li>（第41報）2024年1月14日午後1時00分</li>
            <li>（第42報）2024年1月14日午後5時00分</li>
            <li>（第43報）2024年1月15日午前9時00分</li>
            <li>（第44報）2024年1月15日午後1時00分</li>
            <li>（第45報）2024年1月15日午後5時00分</li>
            <li>（第46報）2024年1月16日午前9時15分</li>
            <li>（第47報）2024年1月16日午後1時30分</li>
            <li>（第48報）2024年1月16日午後5時00分</li>
            <li>（第49報）2024年1月17日午前9時00分</li>
            <li>（第50報）2024年1月17日午後1時00分</li>
            <li>（第51報）2024年1月17日午後6時00分</li>
            <li>（第52報）2024年1月18日午前9時00分</li>
            <li>（第53報）2024年1月18日午後1時00分</li>
            <li>（第54報）2024年1月18日午後5時00分</li>
            <li>（第55報）2024年1月19日午前9時00分</li>
            <li>（第56報）2024年1月19日午後0時30分</li>
            <li>（第57報）2024年1月19日午後7時00分</li>
            <li>（第58報）2024年1月20日午前9時00分</li>
            <li>（第59報）2024年1月20日午後2時00分</li>
            <li>（第60報）2024年1月20日午後7時00分</li>
            <li>（第61報）2024年1月21日午前9時00分</li>
            <li>（第62報）2024年1月21日午後2時00分</li>
            <li>（第63報）2024年1月21日午後7時00分</li>
            <li>（第64報）2024年1月22日午前9時00分</li>
            <li>（第65報）2024年1月22日午後2時00分</li>
            <li>（第66報）2024年1月22日午後7時00分</li>
            <li>（第67報）2024年1月23日午前9時00分</li>
            <li>（第68報）2024年1月23日午後2時00分</li>
            <li>（第69報）2024年1月23日午後7時00分</li>
            <li>（第70報）2024年1月24日午前9時00分</li>
            <li>（第71報）2024年1月24日午後2時00分</li>
            <li>（第72報）2024年1月24日午後7時00分</li>
            <li>（第73報）2024年1月25日午前9時00分</li>
            <li>（第74報）2024年1月25日午後0時00分</li>
            <li>（第75報）2024年1月25日午後2時00分</li>
            <li>（第76報）2024年1月25日午後7時00分</li>
            <li>（第77報）2024年1月26日午前9時00分</li>
            <li>（第78報）2024年1月26日午後2時00分</li>
            <li>（第79報）2024年1月26日午後7時00分</li>
            <li>（第80報）2024年1月27日午前9時00分</li>
            <li>（第81報）2024年1月27日午後2時00分</li>
            <li>（第82報）2024年1月27日午後7時00分</li>
            <li>（第83報）2024年1月28日午前9時00分</li>
            <li>（第84報）2024年1月28日午後2時00分</li>
            <li>（第85報）2024年1月28日午後7時00分</li>
            <li>（第86報）2024年1月29日午前9時00分</li>
            <li>（第87報）2024年1月29日午後2時00分</li>
            <li>（第88報）2024年1月29日午後7時00分</li>
            <li>（第89報）2024年1月30日午前9時00分</li>
            <li>（第90報）2024年1月30日午後2時00分</li>
            <li>（第91報）2024年1月30日午後7時00分</li>
            <li>（第92報）2024年1月31日午前9時00分</li>
            <li>（第93報）2024年1月31日午後6時00分</li>
            <li>（第94報）2024年2月1日午前10時00分</li>
            <li>（第95報）2024年2月1日午後6時00分</li>
            <li>（第96報）2024年2月2日午前10時00分</li>
            <li>（第97報）2024年2月2日午後6時00分</li>
            <li>（第98報）2024年2月3日午前10時00分</li>
            <li>（第99報）2024年2月3日午後6時00分</li>
            <li>（第100報）2024年2月4日午前10時00分</li>
            <li>（第101報）2024年2月4日午後6時00分</li>
            <li>（第102報）2024年2月5日午前10時00分</li>
            <li>（第103報）2024年2月5日午後6時00分</li>
            <li>（第104報）2024年2月6日午前10時00分</li>
            <li>（第105報）2024年2月6日午後6時00分</li>
            <li>（第106報）2024年2月7日午前10時00分</li>
            <li>（第107報）2024年2月7日午後6時00分</li>
            <li>（第108報）2024年2月8日午前10時00分</li>
            <li>（第109報）2024年2月8日午後6時00分</li>
            <li>（第110報）2024年2月9日午前10時00分</li>
            <li>（第111報）2024年2月9日午後2時00分</li>
            <li>（第112報）2024年2月9日午後6時00分</li>
            <li>（第113報）2024年2月10日午前10時00分</li>
            <li>（第114報）2024年2月10日午後6時00分</li>
            <li>（第115報）2024年2月11日午前10時00分</li>
            <li>（第116報）2024年2月11日午後6時00分</li>
            <li>（第117報）2024年2月12日午前10時00分</li>
            <li>（第118報）2024年2月12日午後6時00分</li>
            <li>（第119報）2024年2月13日午前10時00分</li>
            <li>（第120報）2024年2月13日午後6時00分</li>
            <li>（第121報）2024年2月14日午前10時00分</li>
            <li>（第122報）2024年2月14日午後6時00分</li>
            <li>（第123報）2024年2月15日午前10時00分</li>
            <li>（第124報）2024年2月15日午後6時00分</li>
            <li>（第125報）2024年2月16日午前10時00分</li>
            <li>（第126報）2024年2月16日午後6時00分</li>
            <li>（第127報）2024年2月17日午前10時00分</li>
            <li>（第128報）2024年2月17日午後6時00分</li>
            <li>（第129報）2024年2月18日午前10時00分</li>
            <li>（第130報）2024年2月18日午後6時00分</li>
            <li>（第131報）2024年2月19日午前10時00分</li>
            <li>（第132報）2024年2月19日午後6時00分</li>
            <li>（第133報）2024年2月20日午前10時00分</li>
            <li>（第134報）2024年2月20日午後6時00分</li>
            <li>（第135報）2024年2月21日午前10時00分</li>
            <li>（第136報）2024年2月21日午後6時00分</li>
            <li>（第137報）2024年2月22日午前10時00分</li>
            <li>（第138報）2024年2月22日午後6時00分</li>
            <li>（第139報）2024年2月23日午前10時00分</li>
            <li>（第140報）2024年2月23日午後6時00分</li>
            <li>（第141報）2024年2月24日午前10時00分</li>
            <li>（第142報）2024年2月24日午後6時00分</li>
            <li>（第143報）2024年2月25日午前10時00分</li>
            <li>（第144報）2024年2月25日午後6時00分</li>
            <li>（第145報）2024年2月26日午前10時00分</li>
            <li>（第146報）2024年2月26日午後6時00分</li>
            <li>（第147報）2024年2月27日午前10時00分</li>
            <li>（第148報）2024年2月27日午後6時00分</li>
            <li>（第149報）2024年2月28日午前10時00分</li>
            <li>（第150報）2024年2月28日午後6時00分</li>
          </ul>

          <p className={Utils['Mt-32']}>
            最新のお知らせは以下よりご確認ください。
          </p>
          <ul>
            <li>
              ・
              <LinkNormal href="/information/failure/2563/">
                【災害影響】令和6年能登半島地震の影響により、一部のお客様において通信サービスがご利用できない、またはご利用しづらい状況について
              </LinkNormal>
            </li>
          </ul>
        </SystemContainer>
      </SystemWrapper>

      <GlobalFooter breadcrumbsItem={breadcrumbs} />
    </>
  )
}

export default InfoFailure2563Archive
